// JavaScript Document
//省份数据
var mp = ["北京市","江苏","上海市","浙江","重庆市"];
//城市数据
var mc = [
			  ["北京市"],
			  ["常州","淮安","连云港","南京","南通","苏州","宿迁","泰州","无锡","徐州","盐城","扬州","镇江"],
			  ["上海市"],
			  ["杭州","湖州","嘉兴","金华","丽水","宁波","绍兴","台州","温州","舟山","衢州"],
			  ["重庆市"]
		  ];

//区县数据

var mh = [
			  [
			  		["东城区","西城区","朝阳区","丰台区","石景山区","海淀区","门头沟区","房山区","通州区","顺义区","昌平区","大兴区","怀柔区","平谷区","密云县","延庆县"]
			   ],
			  [
			   		["常州市","金坛市","溧阳市"],
					["洪泽县","淮安市","金湖县","涟水县","盱眙县"],
					["东海县","赣榆县","灌南县","灌云县","连云港市"],
					["高淳县","南京市","溧水县"],
					["海安县","海门市","南通市","启东市","如东县","如皋市","通州市"],
					["常熟市","昆山市","苏州市","太仓市","吴江市","张家港市"],
					["宿迁市","宿豫县","沭阳县","泗洪县","泗阳县"],
					["姜堰市","靖江市","泰兴市","泰州市","兴化市"],
					["江阴市","无锡市","宜兴市"],
					["丰县","沛县","铜山县","新沂市","徐州市","邳州市","睢宁县"],
					["滨海县","大丰市","东台市","阜宁县","建湖县","射阳县","响水县","盐城市","盐都县"],
					["宝应县","高邮市","江都市","扬州市","仪征市"],
					["丹阳市","句容市","扬中市","镇江市"]
				],
			  [
			  		["黄浦区","卢湾区","徐汇区","长宁区","静安区","普陀区","闸北区","虹口区","杨浦区","闵行区","宝山区","嘉定区","浦东新区","金山区","松江区","青浦区","南汇区","奉贤区","崇明县"]
				],
			  [
			   		["淳安县","富阳市","杭州市","建德市","临安市","桐庐县"],
					["安吉县","长兴县","德清县","湖州市"],
					["海宁市","海盐县","嘉善县","嘉兴市","平湖市","桐乡市"],
					["东阳市","金华市","兰溪市","磐安县","浦江县","武义县","义乌市","永康市"],
					["景宁畲族自治县","丽水市","龙泉市","青田县","庆元县","松阳县","遂昌县","云和县","缙云县"],
					["慈溪市","奉化市","宁波市","宁海县","象山县","余姚市"],
					["上虞市","绍兴市","绍兴县","新昌县","诸暨市","嵊州市"],
					["临海市","三门县","台州市","天台县","温岭市","仙居县","玉环县"],
					["苍南县","洞头县","乐清市","平阳县","瑞安市","泰顺县","温州市","文成县","永嘉县"],
					["舟山市","岱山县","嵊泗县"],
					["常山县","江山市","开化县","龙游县","衢州市"]
				],
			 [
			   		["城口县","大足县","垫江县","丰都县","奉节县","合川市","江津市","开县","梁平县","南川市","彭水苗族土家族自治县","荣昌县","石柱土家族自治县","铜梁县","巫山县","巫溪县","武隆县","秀山土家族苗族自治县","永川市","酉阳土家族苗族自治县","云阳县","忠县","重庆市","潼南县","璧山县","綦江县"]
			   ]
		  ];



function stateSelectorInit(obj_1,obj_2,obj_3){
	//定义默认数据
	var ar = ["请选择省份","请选择城市","请选择区县"];
	
		//初始化
		$("<option value=''>"+ar[0]+"</option>").appendTo($("#"+obj_1));
		$("<option value=''>"+ar[1]+"</option>").appendTo($("#"+obj_2));
		$("<option value=''>"+ar[2]+"</option>").appendTo($("#"+obj_3));
		
		//初始化p
		for (i=0;i<mp.length;i++){
			$("<option value='"+mp[i]+"'>"+mp[i]+"</option>").appendTo($("#"+obj_1));
		}	
	
	//响应p的change事件
	var pindex;
	$("#"+obj_1).change(function(){
		//获取索引
		// console.log($(this).attr('id') + ' is change');
		pindex = $("#"+obj_1).get(0).selectedIndex;
		//清空c和h
		$("#"+obj_2).empty();
		//重新给c填充内容
		$("<option value=''>"+ar[1]+"</option>").appendTo($("#"+obj_2));
			if (pindex!=0){
				for (k=0;k<mc[pindex-1].length;k++){
					$("<option value='"+mc[pindex-1][k]+"'>"+mc[pindex-1][k]+"</option>").appendTo($("#"+obj_2));
				}
			}	
		//清空h
		$("#"+obj_3).empty();
		$("<option value=''>"+ar[2]+"</option>").appendTo($("#"+obj_3));
	});
	
	//响应c的change事件
	var cindex;
	$("#"+obj_2).change(function(){
		cindex = $("#"+obj_2).get(0).selectedIndex;
		//清空h
		$("#"+obj_3).empty();
		//重新给h填充内容
		$("<option value=''>"+ar[2]+"</option>").appendTo($("#"+obj_3));
		if (cindex!=0){
			for (j=0;j<mh[pindex-1][cindex-1].length;j++){
				$("<option value='"+mh[pindex-1][cindex-1][j]+"'>"+mh[pindex-1][cindex-1][j]+"</option>").appendTo($("#"+obj_3));
			}
		}
	});
	
}